src/cf/Catalogs/НовостиМЛК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>НовостиМЛК</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаИВремяОтправкиPushУведомления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтраницаДляМЛК</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатели</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодробнаяНовость</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/НовостиМЛКДляОтправки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НовостиМЛКДляОтправки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/НовостиМЛК/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура СоздатьИзменитьНовость(СсылкаНаНовость, Заголовок, Сообщение, Получатели, Страница, ДатаИВремяОтправкиPushУведомления, ПодробнаяНовость) Экспорт
	
	Если СсылкаНаНовость = Неопределено Тогда
		Новость = Справочники.НовостиМЛК.СоздатьЭлемент();
	Иначе
		Новость = СсылкаНаНовость.ПолучитьОбъект();
	КонецЕсли;
	
	ТекущаяДата = ТекущаяДатаСеанса();
	
	Новость.Наименование = Заголовок;
	Новость.Сообщение = Сообщение;
	Новость.СтраницаДляМЛК = Новый ХранилищеЗначения(Страница, Новый СжатиеДанных(9));
	Новость.Получатели = Новый ХранилищеЗначения(Получатели, Новый СжатиеДанных(9));
	Новость.ДатаИВремяОтправкиPushУведомления = ДатаИВремяОтправкиPushУведомления;
	Новость.ПодробнаяНовость = Новый ХранилищеЗначения(ПодробнаяНовость, Новый СжатиеДанных(9));
	Новость.ДатаИзменения = ТекущаяДата;
	
	Новость.Записать();
	
	РегистрыСведений.НовостиМЛКДляОтправки.ЗаписатьНовостьДляОтправки(Новость.Ссылка.УникальныйИдентификатор(), ТекущаяДата);
	
КонецПроцедуры


Процедура ПометитьНаУдалениеНовость(Ссылка) Экспорт

	Новость = Ссылка.ПолучитьОбъект();
	Новость.ПометкаУдаления = Истина;
	Новость.Записать();
	
	РегистрыСведений.НовостиМЛКДляОтправки.ЗаписатьНовостьДляОтправки(Новость.Ссылка.УникальныйИдентификатор(), ТекущаяДатаСеанса());
	
КонецПроцедуры


Процедура ОтметитьОтправленныеНовости() Экспорт

	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	НовостиМЛК.Ссылка КАК Ссылка
	//	|ИЗ
	//	|	Справочник.НовостиМЛК КАК НовостиМЛК
	//	|ГДЕ
	//	|	НЕ НовостиМЛК.ОтправленоВШину";
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	Новость = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	//	Новость.ОтправленоВШину = Истина;
	//	Новость.Записать();
	//КонецЦикла;
	
	

КонецПроцедуры


#КонецОбласти

#КонецЕсли
